test/result/statistics.json
{
  "HTTP Request (/)-0" : {
    "transaction" : "HTTP Request (/)-0",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 896.5168999999989,
    "medianResTime" : 887.0,
    "minResTime" : 443.0,
    "maxResTime" : 9644.0,
    "pct1ResTime" : 943.0,
    "pct2ResTime" : 959.0,
    "pct3ResTime" : 1013.0,
    "throughput" : 8.752911437166787,
    "receivedKBytesPerSec" : 5.094467984913481,
    "sentKBytesPerSec" : 3.1284820175810975
  },
  "HTTP Request (/list)" : {
    "transaction" : "HTTP Request (/list)",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 94.94259999999989,
    "medianResTime" : 93.0,
    "minResTime" : 45.0,
    "maxResTime" : 189.0,
    "pct1ResTime" : 110.0,
    "pct2ResTime" : 114.0,
    "pct3ResTime" : 129.0,
    "throughput" : 8.755739387168289,
    "receivedKBytesPerSec" : 22.735850615703594,
    "sentKBytesPerSec" : 1.846913776980811
  },
  "HTTP Request (/)-1" : {
    "transaction" : "HTTP Request (/)-1",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 95.26730000000006,
    "medianResTime" : 93.0,
    "minResTime" : 36.0,
    "maxResTime" : 9038.0,
    "pct1ResTime" : 110.0,
    "pct2ResTime" : 114.0,
    "pct3ResTime" : 129.0,
    "throughput" : 8.755739387168289,
    "receivedKBytesPerSec" : 22.735850615703594,
    "sentKBytesPerSec" : 1.846913776980811
  },
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 10000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.05930000000000002,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 8.756812800358679,
    "receivedKBytesPerSec" : 4.896546329450562,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 62000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 345.0197258064446,
    "medianResTime" : 93.0,
    "minResTime" : 0.0,
    "maxResTime" : 9914.0,
    "pct1ResTime" : 993.0,
    "pct2ResTime" : 1020.0,
    "pct3ResTime" : 1069.0,
    "throughput" : 54.25608346335833,
    "receivedKBytesPerSec" : 99.49446880559607,
    "sentKBytesPerSec" : 12.982901020276898
  },
  "HTTP Request (/)" : {
    "transaction" : "HTTP Request (/)",
    "sampleCount" : 22000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 478.334636363637,
    "medianResTime" : 57.0,
    "minResTime" : 5.0,
    "maxResTime" : 9914.0,
    "pct1ResTime" : 1016.0,
    "pct2ResTime" : 1037.0,
    "pct3ResTime" : 1085.0,
    "throughput" : 19.253506544879485,
    "receivedKBytesPerSec" : 44.06393334698583,
    "sentKBytesPerSec" : 6.163720223795759
  }
}